vim.org
#+TITLE: VimTutor
#+AUTHOR: Bram Moolenaar
#+DATE: June 2019

* Vimtutor for the impatient

** Lesson 1
*** Moving the cursor
    | Command | Description   |
    |---------+---------------|
    | h       | Move to left  |
    | l       | Move to right |
    | j       | Move down     |
    | k       | Move up       |

** Lesson 2
*** Deletion commands
    | Command | Description                                         |
    |---------+-----------------------------------------------------|
    | dw      | Delete the letters from the current word, until end |
    | d$      | Delete to the end of the line                       |
    | dd      | Delete a line                                       |
    | u       | Undo the last command                               |
    | U       | Undo the whole line                                 |
    | Ctrl-R  | Undo the undo's                                     |

** Lesson 3
   | Command | Description                            |
   |---------+----------------------------------------|
   | p       | Put the 'text' below the cursor        |
   | r       | Replace the character under the cursor |
   | ce      | change till the end of the word        |
   | c$      | change till the end of the line        |

** Lesson 4
*** Cursor location and File status
    | Command      | Description                    |
    |--------------+--------------------------------|
    | Ctrl + g     | Show file status               |
    | gg           | Goto the top of the file       |
    | G            | Goto the end of the file       |
    | {linenumer}G | Goto the specified line number |
*** Search commad
    | Command  | Description                                                 |
    |----------+-------------------------------------------------------------|
    | //       | Forward seach                                               |
    | ?        | Backward search                                             |
    | n        | Goto the next instance of the matched phrase                |
    | N        | Goto to the next instance(opposite direction)               |
*** Matching Parentheses search and substitute command
    | Command      | Description                                          |
    |--------------+------------------------------------------------------|
    | %            | Find the matching ), ], }                            |
    | :s/old/new   | substitue the old word with the new word on the line |
    | :s/old/new/g | Globally make this change on the line                |

** Lesson 5
   | Command            | Description                                               |
   |--------------------+-----------------------------------------------------------|
   | :! {shell command} | Execute shell command                                     |
   | :w TEST            | Write the current buffer to a file named 'TEST'           |
   | :r TEST            | Insert content of file 'TEST' below the cursor            |
** Lesson 6
   | Command | Description                        |
   |---------+------------------------------------|
   | a       | Append the text after the cursor   |
   | A       | Append the text at the end of line |
   | y       | Copy(yank)                         |
   | p       | Paste(put)                         |
   | o       | Open a line below the cursor       |
   | O       | Open a line above the cursor       |
   | R       | Replace more than one character    |
** Lesson 7
*** Getting help
    | Command                   | Description                     |
    |---------------------------+---------------------------------|
    | :help                     | Access help window              |
    | :help {helpterm}          | Search for helpterm             |
    | :help {helpterm} Ctrl + d | Show related helpterms          |
    | Ctrl + w Ctrl + w         | Jump from one window to another |
